#+TITLE: Python

*** String concatenation

Three ways to define string concatenation in python.

#+BEGIN_SRC python :results output
variable = "Nomad"
print("Who are you?" + variable)
print("Who are you? {}".format(variable))
print(f"Who are you? {variable}")
print(f"Who are you? \
I am nobody.")
#+END_SRC

#+RESULTS:
: Who are you?Nomad
: Who are you? Nomad
: Who are you? Nomad
: Who are you? I am nobody.
*** Lambda functions

lambda functions are also annonymous functions. They are most throw away functions.
Syntax *lambda arguments:expression*

#+begin_src python :results output
sumof2 = lambda x,y : x+y
print(sumof2(3,4))
sumof1 = lambda x : x+1
print(sumof1(3))
#+end_src

#+RESULTS:
: 7
: 4

*** map function

map function applies a given function to all items of a iterable (list, tuples, etc).
map(function, iterable)
map does some operation based on the function definition and operates on every single item of a list or some other iterable item.
map doesn't return a value or list. map returns an generator object.

#+begin_src python :results output
lis = ["hob", "shwa", "barley"]
ls = map(len, lis)
print(list(ls))
#+end_src

#+RESULTS:
: [3, 4, 6]

*using map with lambda function*

#+begin_src python :results output
ls = [1, 2, 4]
lam = lambda x : x+3
lsd = map(lam, ls)
print(list(lsd))
#+end_src

#+RESULTS:
: [4, 5, 7]

*using map with lambda in logistic function*
logistic function is often used in predictive modeling in machine learning when dealing with binary response variables.

        f(x) = 1/(1+e**-x)

#+begin_src python :results output
import math
nums = [-3, -5, 1, 4]
x = map(lambda x : 1/(1+math.exp(-x)), nums)
print(list(x))
#+end_src

#+RESULTS:
: [0.04742587317756678, 0.0066928509242848554, 0.7310585786300049, 0.9820137900379085]

*** filter function

filter takes a function and iterables as inputs. It returns the elements of the list as a new list if the function returns true for those elements.

filter(function, iterable)
a program that calculates all the multiplies of 3 and 7 below 1000 and sums them up.


#+begin_src python :results output
ls = filter(lambda x : x % 3 == 0 or x % 7 == 0, range(1000))
print(sum(ls))
#+end_src

#+RESULTS:
: 214216

*** sorted function

sorted takes a iterable and sorts the list according to a function
function must be assigned to key. returns a list.

sorted(list, key=function)

#+begin_src python :results output
names = ['kabir', 'Akhi', 'Bolo', 'Desai']
sort = sorted(names, key = lambda x : len(x))
print(sort)

#+end_src

#+RESULTS:
: ['Akhi', 'Bolo', 'kabir', 'Desai']

